N40E116/SDK_2_6_13_FRDM-KW38/middleware/wireless/framework/FSCI/Source/FsciCommands.c
/*! *********************************************************************************
* Copyright (c) 2015, Freescale Semiconductor, Inc.
* Copyright 2016-2018, 2021 NXP
* All rights reserved.
*
* \file
*
* This is a source file which implements the FSCI commands received from the host.
*
* SPDX-License-Identifier: BSD-3-Clause
********************************************************************************** */


/************************************************************************************
*************************************************************************************
* Include
*************************************************************************************
************************************************************************************/

#include "EmbeddedTypes.h"
#include "FsciInterface.h"
#include "FsciCommands.h"
#include "FsciCommunication.h"
#include "FunctionLib.h"
#include "MemManager.h"
#include "ModuleInfo.h"
#include "Flash_Adapter.h"
#include "Reset.h"

#if gFSCI_IncludeMacCommands_c
    #include "FsciMacCommands.h"
#endif

#if (defined(gFSCI_IncludeLpmCommands_c) && gFSCI_IncludeLpmCommands_c == 1)
    #include "PWR_Interface.h"
#endif
#if (defined(gErpcLowPowerApiServiceIncluded_c) && (gErpcLowPowerApiServiceIncluded_c == 1))
    #include "PWR_BlackBox_Interface.h"
#endif

#include "fsl_device_registers.h"

#if (defined(gBeeStackIncluded_d) && gBeeStackIncluded_d == 1)
#include "ZigbeeTask.h"
#endif

#ifdef MULTICORE_APPLICATION_CORE
//#include "erpc_host.h"
#endif

#if gFsciIncluded_c
/************************************************************************************
*************************************************************************************
* Private macros
*************************************************************************************
************************************************************************************/
#if ((defined(CPU_QN908X)) && (CPU_QN908X > 0U))

  #define mRamStartAddress_c (0x04000000)
  #define mRamEndAddress_c   (0x04020000)

#else

  extern uint32_t _RAM_START_[];
  extern uint32_t _RAM_END_[];
  #define mRamStartAddress_c   (uint32_t)(_RAM_START_)
  #define mRamEndAddress_c     (uint32_t)(_RAM_END_)

#endif

/* Flash memory limits */
#define mFlashStartAddress_c (0x00000000U)
#define mFlashEndAddress_c   ((uint32_t)FSL_FEATURE_FLASH_PFLASH_BLOCK_SIZE * (uint32_t)FSL_FEATURE_FLASH_PFLASH_BLOCK_COUNT)

/* Weak function. */
#if defined(__GNUC__)
#define __WEAK_FUNC __attribute__((weak))
#elif defined(__ICCARM__)
#define __WEAK_FUNC __weak
#elif defined( __CC_ARM )
#define __WEAK_FUNC __weak
#endif

/* \brief FSCI Bootloader related settings */
#define gFsciBootTrigger_c                 (0xF5C18007U)

#if ((defined(CPU_QN908X)) && (CPU_QN908X > 0U))
  #define gBootImageFlagsAddress_c       (5*1024 + NUMBER_OF_INT_VECTORS*4)
#elif (defined(CPU_MKW36Z512VFP4) || defined(CPU_MKW36Z512VHT4))
  #define gBootImageFlagsAddress_c       (mFlashEndAddress_c / 64 + NUMBER_OF_INT_VECTORS*4)
#elif (defined(CPU_K32W042S1M2VPJ_cm4))
  #define gBootImageFlagsAddress_c       (16*1024)
#else
  #ifndef GCOV_DO_COVERAGE
    #define gBootImageFlagsAddress_c       (mFlashEndAddress_c / 32 + NUMBER_OF_INT_VECTORS*4)
  #else
    #define gBootImageFlagsAddress_c       (mFlashEndAddress_c - (uint32_t)FSL_FEATURE_FLASH_PFLASH_BLOCK_WRITE_UNIT_SIZE)
  #endif
#endif

#if defined(gFSCI_MemAllocTest_Enabled_d) && (gFSCI_MemAllocTest_Enabled_d)
/*
 * \brief   Converts the macro argument from milliseconds to microseconds
 */
#define TmrMillisecondsToMicroseconds( n )   ( (uint64_t) ((n) * 1000UL) )
#endif
  
/************************************************************************************
*************************************************************************************
* Private prototypes
*************************************************************************************
************************************************************************************/
#if gFSCI_IncludeMacCommands_c && !gFsciHost_802_15_4_c
extern void Mac_GetExtendedAddress(uint8_t *pAddr, instanceId_t instanceId);
extern void Mac_SetExtendedAddress(uint8_t *pAddr, instanceId_t instanceId);
#endif
#if gFSCI_IncludeMacCommands_c
extern uint8_t PhyGetLastRxLqiValue(void);
#endif

#if defined(gFSCI_MemAllocTest_Enabled_d) && (gFSCI_MemAllocTest_Enabled_d)
bool_t FSCI_MemAllocTestCanAllocate(void *pCaller);
#endif

/************************************************************************************
*************************************************************************************
* Private type definitions
*************************************************************************************
************************************************************************************/
typedef PACKED_STRUCT FsciWakeUpConfig_tag
{
    bool_t   signalWhenWakeUpFlag; /* Flag used to send or not a WakeUp.Ind message */
    uint32_t deepSleepDuration;    /* The deep sleep duration in 802.15.4 phy symbols (16 us) */
}FsciWakeUpConfig_t;

#if defined(gFSCI_MemAllocTest_Enabled_d) && (gFSCI_MemAllocTest_Enabled_d)
typedef PACKED_STRUCT FsciMemAllocBufferTest_tag
{
    uint32_t LRMinValue;                /* Min value of the link register interval  */
    uint32_t LRMaxValue;                /* Max value of the link register interval  */
    bool_t   enableNumberOfBuffers;     /* Enable Number of buffers feature*/
    uint8_t  numberOfBuffersValue;      /* Number of buffers to not be allocated for 
                                           the requested LR nterval */
    bool_t   enableTimeOfNoAllocation;  /* Enable Time of failure test */
    uint32_t timeOfNoAllocationValue;   /* Time in milliseconds when buffers will not be 
                                           allocated for request from LR the interval */ 
    uint64_t endtimeOfFailureValue;     /* Time in microseconds when to disable the time condition */
    bool_t   enable;                    /* TRUE - test condition enable,
                                           FALSE - test condition disabled */
    uint8_t  counterNumberOfBuffers;    /* Counts the number of buffers executed for this slot */
}FsciMemAllocBufferTest_t;
#endif
/************************************************************************************
*************************************************************************************
* Public memory declarations
*************************************************************************************
************************************************************************************/
/* Set to TRUE when FSCI_Error() is called. */
uint8_t mFsciErrorReported;
bool_t (*pfFSCI_OtaSupportCalback)(clientPacket_t* pPacket) = NULL;

/************************************************************************************
*************************************************************************************
* Private memory declarations
*************************************************************************************
************************************************************************************/
/* FSCI Error message */
static gFsciErrorMsg_t mFsciErrorMsg = {
    {
        gFSCI_StartMarker_c,
        gFSCI_CnfOpcodeGroup_c,
        mFsciMsgError_c,
        (fsciLen_t)sizeof(clientPacketStatus_t),
    },
    (uint8_t)gFsciSuccess_c,
    0,
    0
};

/* FSCI Ack message */
#if gFsciTxAck_c
static gFsciAckMsg_t mFsciAckMsg = {
    {
        gFSCI_StartMarker_c,
        gFSCI_CnfOpcodeGroup_c,
        mFsciMsgAck_c,
        sizeof(uint8_t)
    },
    0,
    0,
    0
};
#endif

/* FSCI OpCodes and coresponding handler functions */
static const gFsciOpCode_t FSCI_ReqOCtable[] =
{
    {mFsciMsgModeSelectReq_c,                FSCI_MsgModeSelectReqFunc},
    {mFsciMsgGetModeReq_c,                   FSCI_MsgGetModeReqFunc},
    {mFsciMsgResetCPUReq_c,                  FSCI_MsgResetCPUReqFunc},
    {mFsciMsgGetNumberOfFreeBuffersReq_c,    FSCI_GetNumberOfFreeBuffersFunc},

