N40E116/SDK_2_6_13_FRDM-KW38/middleware/wireless/framework/FSCI/Source/FsciCommands.c
    (void)Serial_SyncWrite( gFsciSerialInterfaces[fsciInterface], (uint8_t*)&mFsciAckMsg, size );
}
#endif

#if gFsciHostSupport_c
/*! *********************************************************************************
* \brief  Send a CPU-Reset Request to a FSCI black box
*
* \param[in] fsciInterface the interface to send the packet on
*
********************************************************************************** */
gFsciStatus_t FSCI_ResetReq(uint32_t fsciInterface)
{
    clientPacket_t *pFsciPacket = MEM_BufferAlloc(sizeof(clientPacketHdr_t) + 2u);
    gFsciStatus_t  status = gFsciSuccess_c;
    uint8_t        checksum = 0;
    uint8_t        size = 0;

    if( NULL == pFsciPacket )
    {
        status = gFsciOutOfMessages_c;
    }
    else
    {
        pFsciPacket->structured.header.startMarker = gFSCI_StartMarker_c;
        pFsciPacket->structured.header.opGroup = gFSCI_ReqOpcodeGroup_c;
        pFsciPacket->structured.header.opCode = mFsciMsgResetCPUReq_c;
        pFsciPacket->structured.header.len = 0;
        size = sizeof(clientPacketHdr_t) + 1;
        checksum = FSCI_computeChecksum(pFsciPacket->raw+1, size - 2);
        pFsciPacket->structured.payload[0] = checksum;
        (void)Serial_SyncWrite(gFsciSerialInterfaces[fsciInterface], pFsciPacket->raw, size);
        (void)MEM_BufferFree(pFsciPacket);
    }

    return status;
}
#endif

/*! *********************************************************************************
* \brief   Set FSCI operating mode for certain OpGroups
*
* \param[in] pData pointer to location of the received data
* \param[in] fsciInterface the interface on which the packet was received
*
* \return  TRUE in order to recycle the received message
*
********************************************************************************** */
bool_t FSCI_MsgModeSelectReqFunc(clientPacket_t * pData, uint32_t fsciInterface)
{
    uint8_t i;
    uint8_t payloadIndex = 0;
    gFsciOpGroup_t *p;

    fsciLen_t dataLen = pData->structured.header.len;

    if( dataLen > 0u )
    {
        /* gFsciTxBlocking = pData->structured.payload[payloadIndex] */
        payloadIndex++;
        dataLen--;
    }

    for( i = 0; i < dataLen; i++ )
    {
        p = FSCI_GetReqOpGroup(mFsciModeSelectSAPs[i], (uint8_t)fsciInterface);
        if( NULL != p )
        {
            p->mode = (gFsciMode_t)pData->structured.payload[payloadIndex + i];
        }
    }

    pData->structured.payload[0] = (uint8_t)gFsciSuccess_c;
    pData->structured.header.len = (fsciLen_t)sizeof(uint8_t);
    return TRUE;
}

/*! *********************************************************************************
* \brief   Returns FSCI operating mode for certain OpGroups
*
* \param[in] pData pointer to location of the received data
* \param[in] fsciInterface the interface on which the packet was received
*
* \return  TRUE in order to recycle the received message
*
********************************************************************************** */
bool_t FSCI_MsgGetModeReqFunc(clientPacket_t * pData, uint32_t fsciInterface)
{
    uint8_t i;
    uint8_t payloadIndex = 0;
    gFsciOpGroup_t *p;

    pData->structured.payload[payloadIndex++] = (uint8_t)gFsciSuccess_c;
    pData->structured.payload[payloadIndex++] = (uint8_t)gFsciTxBlocking;

    for( i = 0; i < NumberOfElements(mFsciModeSelectSAPs); i++ )
    {
        p = FSCI_GetReqOpGroup(mFsciModeSelectSAPs[i], (uint8_t)fsciInterface);
        if( NULL != p )
        {
            pData->structured.payload[payloadIndex++] = (uint8_t)(p->mode);
        }
        else
        {
            pData->structured.payload[payloadIndex++] = (uint8_t)gFsciInvalidMode;
        }
    }

    pData->structured.header.len = payloadIndex;
    return TRUE;
}

/*! *********************************************************************************
* \brief   Function used for writing to RAM memory.
*          Payload contains the packet received over the serial interface
*          bytes 0-3 --> start address for writing
*          byte  4   --> number of bytes to be written
*          bytes 5+  --> data to be written starting with start address.
*
* \param[in] pData pointer to location of the received data
* \param[in] fsciInterface the interface on which the packet was received
*
* \return  TRUE in order to recycle the received message
*
********************************************************************************** */
bool_t FSCI_WriteMemoryBlock(clientPacket_t * pData, uint32_t fsciInterface)
{
    uint16_t len;
    uint8_t *addr;

    FLib_MemCpy(&addr, pData->structured.payload, sizeof(uint8_t*));
    len = pData->structured.payload[sizeof(uint8_t*)];

    /* Check RAM boundaries */
    if( (mRamStartAddress_c <= (uint32_t)addr) && (mRamEndAddress_c >= (uint32_t)addr))
    {
        FLib_MemCpy(addr, &pData->structured.payload[sizeof(uint8_t*) + 1u], len);
    }
    else
    {
        FSCI_Error((uint8_t)gFsciError_c, fsciInterface);
        len = 0;
    }

    pData->structured.header.len = (uint16_t)sizeof(len);
    pData->structured.payload[0] = (uint8_t)len;
    return TRUE;
}

/*! *********************************************************************************
* \brief   Function used for reading from RAM memory.
*          Payload contains the packet received over the serial interface
*          bytes 0-3 --> start address for reading
*          byte  4   --> number of bytes to read
*
* \param[in] pData pointer to location of the received data
* \param[in] fsciInterface the interface on which the packet was received
*
* \return  TRUE in order to recycle the received message
*
********************************************************************************** */
bool_t FSCI_ReadMemoryBlock(clientPacket_t * pData, uint32_t fsciInterface)
{
    clientPacket_t *pPkt;
    uint16_t len;
    uint32_t *addr;
    bool_t status = TRUE; /* Try to reuse the received buffer */

    FLib_MemCpy(&addr, pData->structured.payload, sizeof(uint8_t*));
    len = pData->structured.payload[sizeof(uint8_t*)];

    if( MEM_BufferGetSize(pData) >= (sizeof(clientPacketHdr_t) + len + gFsci_TailBytes_c) )
    {
        pPkt = pData;
    }
    else
    {
        pPkt = MEM_BufferAlloc( (uint32_t)sizeof(clientPacketHdr_t) + len + gFsci_TailBytes_c );
    }

