N40E116/SDK_2_6_13_FRDM-KW38/middleware/wireless/framework/FSCI/Source/FsciCommands.c
    if( pPkt == NULL )
    {
        FSCI_Error( (uint8_t)gFsciOutOfMessages_c, fsciInterface );
        (void)MEM_BufferFree(pData);
        status = FALSE;
    }
    /* Check RAM and FLASH boundaries */
    else if (((mRamStartAddress_c <= (uint32_t)addr) && ((uint32_t)addr <= mRamEndAddress_c)) ||
        ((mFlashStartAddress_c < (uint32_t)addr) && ((uint32_t)addr <= mFlashEndAddress_c)))
    {
        FLib_MemCpy(pPkt->structured.payload, addr, len);

        pPkt->structured.header.len = len;

        /* Check if the received buffer was reused. */
        if (pPkt != pData)
        {
            /* A new buffer was allocated. Fill with aditional information */
            pPkt->structured.header.opGroup = gFSCI_CnfOpcodeGroup_c;
            pPkt->structured.header.opCode = mFsciLowLevelMemoryReadBlock_c;
            FSCI_transmitFormatedPacket( pPkt, fsciInterface );
            (void)MEM_BufferFree(pData);
            status = FALSE;
        }
    }
    else
    {
        FSCI_Error((uint8_t)gFsciError_c, fsciInterface);
        (void)MEM_BufferFree(pData);
        status = FALSE;
    }

    return status;
}

/*! *********************************************************************************
* \brief  This function simply echoes back the payload
*
* \param[in] pData pointer to location of the received data
* \param[in] fsciInterface the interface on which the packet was received
*
* \return  TRUE in order to recycle the received message
*
* \remarks Remarks: if USB communication is used, the connection will be lost
*
********************************************************************************** */
bool_t  FSCI_Ping(clientPacket_t * pData, uint32_t fsciInterface)
{
    /* Nothing to do here */
    return TRUE;
}

/*! *********************************************************************************
* \brief  This function resets the MCU
*
* \param[in] pData pointer to location of the received data
* \param[in] fsciInterface the interface on which the packet was received
*
* \return  TRUE in order to recycle the received message
*
* \remarks Remarks: if USB communication is used, the connection will be lost
*
********************************************************************************** */
bool_t FSCI_MsgResetCPUReqFunc(clientPacket_t * pData, uint32_t fsciInterface)
{
    bool_t status = FALSE;
#if gFSCI_IncludeMacCommands_c && gFsciHost_802_15_4_c
    /* Get Host FSCI interface for MAC instance and forward packet */
    clientPacket_t *pFsciPacket = MEM_BufferAlloc(sizeof(clientPacketHdr_t) + 9);
    uint8_t checksum;
    uint8_t size;

    if( NULL == pFsciPacket )
    {
        FSCI_Error( gFsciOutOfMessages_c, fsciInterface );
        status = FALSE;
    }
    else
    {
        FLib_MemCpy(pFsciPacket, pData, sizeof(clientPacketHdr_t));
        pFsciPacket->structured.header.startMarker = gFSCI_StartMarker_c;
        size = sizeof(clientPacketHdr_t) + pFsciPacket->structured.header.len + 1 /* CRC */;

        /* Compute Checksum */
        checksum = FSCI_computeChecksum(pFsciPacket->raw+1, size - 2);
        pFsciPacket->structured.payload[pFsciPacket->structured.header.len] = checksum;

        (void)Serial_SyncWrite(gFsciSerialInterfaces[fsciHostGetMacInterfaceId(fsciGetMacInstanceId(fsciInterface))],
                               pFsciPacket->raw,
                               size+9); /* additional bytes to allow last byte reception */

        (void)MEM_BufferFree(pFsciPacket);
    }
#endif

#if gFSCI_ResetCpu_c
    ResetMCU();
#endif

    (void)MEM_BufferFree(pData);
    return status;
}

/*! *********************************************************************************
* \brief Read the number of free MemManager buffers
*
* \param[in] pData pointer to location of the received data
* \param[in] fsciInterface the interface on which the packet was received
*
* \return  TRUE in order to recycle the received message
*
********************************************************************************** */
bool_t FSCI_GetNumberOfFreeBuffersFunc(clientPacket_t * pData, uint32_t fsciInterface)
{
    (void)MEM_BufferFree(pData);
    FSCI_transmitPayload( gFSCI_CnfOpcodeGroup_c, mFsciMsgGetNumberOfFreeBuffersReq_c, (void*)&gFreeMessagesCount, (uint16_t)sizeof(gFreeMessagesCount), fsciInterface);
    return FALSE;
}

/*! *********************************************************************************
* \brief  This function writes the MAC Extended Address into the MAC layer
*
* \param[in] pData pointer to location of the received data
* \param[in] fsciInterface the interface on which the packet was received
*
* \return  TRUE in order to recycle the received message
*
* \remarks Remarks: this function is legacy
*
********************************************************************************** */
bool_t FSCI_MsgWriteExtendedAdrReqFunc(clientPacket_t * pData, uint32_t fsciInterface)
{
#if gFSCI_IncludeMacCommands_c

#if gFsciHost_802_15_4_c
    /* Get Host FSCI interface for MAC instance and forward packet */
    clientPacket_t *pFsciPacket = MEM_BufferAlloc(sizeof(clientPacketHdr_t) + sizeof(uint64_t) + gFsci_TailBytes_c);
    if( NULL == pFsciPacket )
    {
        FSCI_Error( gFsciOutOfMessages_c, fsciInterface );
        pData->structured.payload[0] = gFsciOutOfMessages_c;
        pData->structured.header.len = sizeof(clientPacketStatus_t);
        return FALSE;
    }
    else
    {
        FLib_MemCpy(pFsciPacket, pData, sizeof(clientPacketHdr_t) + sizeof(uint64_t));
        FSCI_transmitFormatedPacket( pFsciPacket, fsciHostGetMacInterfaceId(fsciGetMacInstanceId(fsciInterface)) );
    }
#else
    Mac_SetExtendedAddress( pData->structured.payload, fsciGetMacInstanceId(fsciInterface) );
#endif

#if gRF4CEIncluded_d
    extern uint8_t aExtendedAddress[8];
    FLib_MemCpy(aExtendedAddress,pData->structured.payload, 8);
#endif

    pData->structured.payload[0] = (uint8_t)gFsciSuccess_c;
#else
    pData->structured.payload[0] = (uint8_t)gFsciRequestIsDisabled_c;
#endif /* gFSCI_IncludeMacCommands_c */
    pData->structured.header.len = (fsciLen_t)sizeof(clientPacketStatus_t);
    return TRUE;
}

/*! *********************************************************************************
* \brief  This function sends the MAC Extended Address over the serial interface
*
* \param[in] pData pointer to location of the received data
* \param[in] fsciInterface the interface on which the packet was received
*
* \return  TRUE in order to recycle the received message
*
* \remarks Remarks: this function is legacy
*
********************************************************************************** */
bool_t FSCI_MsgReadExtendedAdrReqFunc(clientPacket_t * pData, uint32_t fsciInterface)
{
#if gFSCI_IncludeMacCommands_c && !gFsciHost_802_15_4_c
    Mac_GetExtendedAddress( &pData->structured.payload[sizeof(clientPacketStatus_t)], fsciGetMacInstanceId(fsciInterface) );

