N40E116/SDK_2_6_13_FRDM-KW38/middleware/wireless/framework/FSCI/Source/FsciCommands.c
    pData->structured.payload[0] = gFsciSuccess_c;
    pData->structured.header.len = sizeof(clientPacketStatus_t) + sizeof(uint64_t);
#else
    pData->structured.payload[0] = (uint8_t)gFsciRequestIsDisabled_c;
    pData->structured.header.len = (fsciLen_t)sizeof(clientPacketStatus_t);
#endif
    return TRUE;
}

/*! *********************************************************************************
* \brief  This function sends the LQI value for the last received packet over
*         the serial interface
*
* \param[in] pData pointer to location of the received data
* \param[in] fsciInterface the interface on which the packet was received
*
* \return  TRUE in order to recycle the received message
*
********************************************************************************** */
#if gFSCI_IncludeMacCommands_c
bool_t FSCI_GetLastLqiValue(clientPacket_t * pData, uint32_t fsciInterface)
{
    pData->structured.payload[0] = PhyGetLastRxLqiValue();
    pData->structured.header.len = sizeof(clientPacketStatus_t);
    return TRUE;
}
#endif

#if gFSCI_IncludeLpmCommands_c

__WEAK_FUNC bool_t PWR_ChangeDeepSleepMode(uint8_t dsMode)
{
  (void)dsMode;
  return TRUE;
}

/*! *********************************************************************************
* \brief Allow the MCU to enter LowPower
*
* \param[in] pData pointer to location of the received data
* \param[in] fsciInterface the interface on which the packet was received
*
* \return  TRUE in order to recycle the received message
*
********************************************************************************** */
bool_t FSCI_MsgAllowDeviceToSleepReqFunc(clientPacket_t * pData, uint32_t fsciInterface)
{
    uint8_t dsMode = PWR_GetDeepSleepMode();

    mFsciInterfaceToSendWakeUp = (uint8_t)fsciInterface;
    /* Set the new configuration */
    FLib_MemCpy(&mFsciWakeUpConfig,
                pData->structured.payload,
                sizeof(mFsciWakeUpConfig));
    if(pData->structured.header.len > sizeof(mFsciWakeUpConfig))
    {
      dsMode = pData->structured.payload[sizeof(mFsciWakeUpConfig)];
    }

    if( mFsciWakeUpConfig.deepSleepDuration < 10 )
    {
        pData->structured.payload[0] = gFsciError_c;
    }
    else
    {
        pData->structured.payload[0] = gFsciSuccess_c;
    }

    pData->structured.header.opGroup = gFSCI_CnfOpcodeGroup_c;
    pData->structured.header.len = sizeof(clientPacketStatus_t);

    // Perform a Sync Tx
    gFsciTxBlocking = TRUE;
    FSCI_transmitFormatedPacket(pData, fsciInterface);
    gFsciTxBlocking = FALSE;

    if( mFsciWakeUpConfig.deepSleepDuration >= 10 )
    {
#ifdef MULTICORE_APPLICATION_CORE
  #if gErpcLowPowerApiServiceIncluded_c
        PWR_ChangeBlackBoxDeepSleepMode(dsMode);
        PWR_SetBlackBoxDeepSleepTimeInMs(mFsciWakeUpConfig.deepSleepDuration*16/1000);
        PWR_AllowBlackBoxToSleep();  /* Allow device to sleep */
  #endif
        PWR_ChangeDeepSleepMode(dsMode);
        PWR_SetDeepSleepTimeInSymbols(mFsciWakeUpConfig.deepSleepDuration);
        PWR_AllowDeviceToSleep();  /* Allow device to sleep */
  #else
        PWR_ChangeDeepSleepMode(dsMode);
        PWR_SetDeepSleepTimeInSymbols(mFsciWakeUpConfig.deepSleepDuration);
        PWR_AllowDeviceToSleep();  /* Allow device to sleep */
#endif
    }

    return FALSE;
}
/*! *********************************************************************************
* \brief Read the MCU wake-up reason
*
* \param[in] pData pointer to location of the received data
* \param[in] fsciInterface the interface on which the packet was received
*
* \return  TRUE in order to recycle the received message
*
********************************************************************************** */
bool_t FSCI_MsgGetWakeUpReasonReqFunc(clientPacket_t * pData, uint32_t fsciInterface)
{
    (void)MEM_BufferFree(pData);
    FSCI_transmitPayload( gFSCI_CnfOpcodeGroup_c, mFsciMsgGetWakeUpReasonReq_c, (void*)&PWRLib_MCU_WakeupReason, (uint16_t)sizeof(PWRLib_WakeupReason_t), fsciInterface);
    return FALSE;
}

/*! *********************************************************************************
* \brief Notify that the MCU has exit LowPower mode
*
* \param[in] pData pointer to location of the received data
* \param[in] fsciInterface the interface on which the packet was received
*
* \return  TRUE in order to recycle the received message
*
********************************************************************************** */
void FSCI_SendWakeUpIndication( void )
{
    clientPacket_t *pPkt;

    PWR_DisallowDeviceToSleep();  /* Disallow device to sleep */
    #ifdef MULTICORE_APPLICATION_CORE
      #if gErpcLowPowerApiServiceIncluded_c
             PWR_DisallowBlackBoxToSleep();  /* Allow device to sleep */
      #endif
    #endif

    if( mFsciWakeUpConfig.signalWhenWakeUpFlag )
    {
        pPkt = MEM_BufferAlloc(sizeof(clientPacketHdr_t) +
                               sizeof(clientPacketStatus_t) + gFsci_TailBytes_c);

        if (pPkt)
        {
            pPkt->structured.header.opGroup = gFSCI_CnfOpcodeGroup_c;
            pPkt->structured.header.opCode = mFsciMsgWakeUpIndication_c;
            pPkt->structured.header.len = sizeof(clientPacketStatus_t);
            pPkt->structured.payload[0] = gFsciSuccess_c;
            FSCI_transmitFormatedPacket( pPkt, mFsciInterfaceToSendWakeUp );
        }
    }
}
#endif /* #if gFSCI_IncludeLpmCommands_c */

/*! *********************************************************************************
* \brief  This function sends the content of the SIM_UID registers over the
*         serial interface
*
* \param[in] pData pointer to location of the received data
* \param[in] fsciInterface the interface on which the packet was received
*
* \return  TRUE in order to recycle the received message
*
********************************************************************************** */
bool_t FSCI_ReadUniqueId(clientPacket_t * pData, uint32_t fsciInterface)
{
    clientPacket_t *pPkt;
    uint8_t *p;
    bool_t status;
    uint32_t size = sizeof(clientPacketHdr_t) + 4u*sizeof(uint32_t) + gFsci_TailBytes_c;

    /* Check if the received buffer is large enough to be reused */
    if( MEM_BufferGetSize(pData) >= size )
    {
        pPkt = pData;
    }
    else
    {
        pPkt = MEM_BufferAlloc(size);
    }

