N40E116/SDK_2_6_13_FRDM-KW38/middleware/wireless/framework/FSCI/Source/FsciCommands.c
    if( pPkt == NULL )
    {
        FSCI_Error((uint8_t)gFsciOutOfMessages_c, fsciInterface);
        (void)MEM_BufferFree(pData);
        status = FALSE;
    }
    else
    {
        p = pPkt->structured.payload;
        pPkt->structured.header.len = 4u*sizeof(uint32_t);
#if defined(SIM_UIDH_UID_MASK) && !defined(SIM_UIDM_UID_MASK)
        FLib_MemCpy(p, (void*)&SIM->UIDH, sizeof(uint32_t));
#else
        FLib_MemSet(p, 0, sizeof(uint32_t));
#endif
#if (defined(FSL_FEATURE_SOC_SIM_COUNT) && (FSL_FEATURE_SOC_SIM_COUNT > 0U))
        {
            p += sizeof(uint32_t);
#if defined(SIM_UIDMH_UID_MASK)
            FLib_MemCpy(p, (void const *)((uint32_t *)((uint32_t)&SIM->UIDMH)), sizeof(uint32_t));
#elif defined(SIM_UIDH_UID_MASK)
            FLib_MemCpy(p, (void*)&SIM->UIDH, sizeof(uint32_t));
#endif
            p += sizeof(uint32_t);
#if defined(SIM_UIDML_UID_MASK)
            FLib_MemCpy(p, (void const *)((uint32_t *)((uint32_t)&SIM->UIDML)), sizeof(uint32_t));
#elif defined(SIM_UIDM_UID_MASK)
            FLib_MemCpy(p, (void*)&SIM->UIDM, sizeof(uint32_t));
#endif
            p += sizeof(uint32_t);
            FLib_MemCpy(p, (void const *)((uint32_t *)((uint32_t)&SIM->UIDL)), sizeof(uint32_t));
        }
#else /*(defined(FSL_FEATURE_SOC_SIM_COUNT) && (FSL_FEATURE_SOC_SIM_COUNT > 0U))*/
        p += sizeof(uint32_t);
        // #TODO - use BLE_address instead of 0xFF
        FLib_MemSet(p, 0xff, sizeof(uint32_t)*3u);
#endif /*(defined(FSL_FEATURE_SOC_SIM_COUNT) && (FSL_FEATURE_SOC_SIM_COUNT > 0U))*/

        /* Check if the received buffer was reused. */
        if( pPkt != pData )
        {
            /* A new buffer was allocated. Fill with aditional information */
            pPkt->structured.header.opGroup = gFSCI_CnfOpcodeGroup_c;
            pPkt->structured.header.opCode = mFsciGetUniqueId_c;
            FSCI_transmitFormatedPacket(pPkt, fsciInterface);
            (void)MEM_BufferFree(pData);
            status = FALSE;
        }
        else
        {
            status = TRUE;
        }
    }

    return status;
}

/*! *********************************************************************************
* \brief  This function sends the content of the SIM_SDID register over the
*         serial interface
*
* \param[in] pData pointer to location of the received data
* \param[in] fsciInterface the interface on which the packet was received
*
* \return  TRUE in order to recycle the received message
*
********************************************************************************** */
bool_t FSCI_ReadMCUId(clientPacket_t * pData, uint32_t fsciInterface)
{
    pData->structured.header.len = (fsciLen_t)sizeof(uint32_t);
#if (defined(FSL_FEATURE_SOC_SIM_COUNT) && (FSL_FEATURE_SOC_SIM_COUNT > 0U))
    FLib_MemCpy(pData->structured.payload, (void const *)((uint32_t *)((uint32_t)&SIM->SDID)), sizeof(uint32_t));
#else
    FLib_MemSet(pData->structured.payload, 0xff, sizeof(uint32_t));
#endif
    return TRUE;
}

/*! *********************************************************************************
* \brief  This function reads all module information located in section VERSION_TAGS
*         and sends this information over the serial interface
*
* \param[in] pData pointer to location of the received data
* \param[in] fsciInterface the interface on which the packet was received
*
* \return  TRUE in order to recycle the received message
*
********************************************************************************** */
bool_t FSCI_ReadModVer(clientPacket_t * pData, uint32_t fsciInterface)
{
    bool_t status = TRUE;
    clientPacket_t *pPkt;
    moduleInfo_t *pInfo = gVERSION_TAGS_startAddr_d;
    uint8_t noOfEntriesSecondaryCore = 0;
#if defined(CPU_K32W042S1M2VPJ_cm4) && (CPU_K32W042S1M2VPJ_cm4 == 1)
    uint8_t* pString = MEM_BufferAlloc(MAX_REGISTERED_MODULES_STRLEN);
    uint8_t totalLen = 0;
    if(NULL != pString)
    {
        noOfEntriesSecondaryCore = ModVer_GetNoOfEntries_Multicore();
    }
#endif
    uint16_t size = (uint16_t)(sizeof(clientPacketHdr_t) + gFsci_TailBytes_c +
                    gVERSION_TAGS_entries_d * gVERSION_TAGS_entrySizeNoPadding_d +
                    noOfEntriesSecondaryCore * gVERSION_TAGS_entrySizeNoPadding_d);

    /* Check if the received buffer is large enough to be reused */
    if( MEM_BufferGetSize(pData) >= size )
    {
        pPkt = pData;
    }
    else
    {
        pPkt = MEM_BufferAlloc( size );
    }

    if( pPkt == NULL)
    {
        FSCI_Error( (uint8_t)gFsciOutOfMessages_c, fsciInterface );
        (void)MEM_BufferFree(pData);
        status = FALSE;
    }
    else
    {
        pPkt->structured.payload[0] = (uint8_t)(gVERSION_TAGS_entries_d + noOfEntriesSecondaryCore);
        size = (uint16_t)sizeof(uint8_t);

        while( pInfo < gVERSION_TAGS_endAddr_d )
        {
            FLib_MemCpy( &pPkt->structured.payload[size],
                        &pInfo->moduleId,
                        gVERSION_TAGS_entrySizeNoPaddingNoModuleString_d );
            size += gVERSION_TAGS_entrySizeNoPaddingNoModuleString_d;
            pInfo++;
        }

#if defined(CPU_K32W042S1M2VPJ_cm4) && (CPU_K32W042S1M2VPJ_cm4 == 1)
        if(NULL != pString)
        {
            totalLen = ModVer_GetInfoFSCIFormat_Multicore(pString);
            FLib_MemCpy(&pPkt->structured.payload[size], pString, totalLen);
            size += totalLen;
            (void)MEM_BufferFree(pString);
        }
#endif
        pPkt->structured.header.len = (uint8_t)size;

        /* Check if the received buffer was reused. */
        if( pPkt != pData )
        {
            /* A new buffer was allocated. Fill with aditional information */
            pPkt->structured.header.opGroup = gFSCI_CnfOpcodeGroup_c;
            pPkt->structured.header.opCode = mFsciGetSwVersions_c;
            FSCI_transmitFormatedPacket( pPkt, fsciInterface );
            (void)MEM_BufferFree(pData);
            status = FALSE;
        }
    }

    return status;
}

#if defined(gFSCI_MemAllocTest_Enabled_d) && (gFSCI_MemAllocTest_Enabled_d)
/*! *********************************************************************************
* \brief   Add possibility that for a number of times or a period of time a memory
*          block will not be allocated for a specific location identified with a link
*          register interval.
*
* \param[in] pData pointer to location of the received data
* \param[in] fsciInterface the interface on which the packet was received
*
* \return  TRUE in order to recycle the received message
*
********************************************************************************** */
bool_t FSCI_MemAllocTest(clientPacket_t * pData, uint32_t fsciInterface)
{
    uint64_t systemTime;
    uint8_t coppyIndex = 0;
    
    /* Copy LRMinValue and LRMaxValue and enableNumberOfBuffers */
    FLib_MemCpy(&mFSCI_MemAllocBufferTest[mFSCI_MemAllocBufferTestIndex], 
                pData->structured.payload, 9);
    coppyIndex = coppyIndex + 9;

    if(mFSCI_MemAllocBufferTest[mFSCI_MemAllocBufferTestIndex].enableNumberOfBuffers == TRUE)
    {
        /* Coppy numberOfBuffersValue and enableTimeOfNoAllocation if enableNumberOfBuffers enabled */
        FLib_MemCpy(&mFSCI_MemAllocBufferTest[mFSCI_MemAllocBufferTestIndex].numberOfBuffersValue, 
                    &pData->structured.payload[coppyIndex], 2);
        coppyIndex = coppyIndex + 2;
    }
    else
    {
        /* Copy enableTimeOfNoAllocation if enableNumberOfBuffers is not enabled */
        FLib_MemCpy(&mFSCI_MemAllocBufferTest[mFSCI_MemAllocBufferTestIndex].enableTimeOfNoAllocation, 
                    &pData->structured.payload[coppyIndex], 1);
        coppyIndex = coppyIndex + 1;
    }
    
    if(mFSCI_MemAllocBufferTest[mFSCI_MemAllocBufferTestIndex].enableTimeOfNoAllocation == TRUE)
    {
        /* Copy timeOfNoAllocationValue if enableTimeOfNoAllocation enabled */
        FLib_MemCpy(&mFSCI_MemAllocBufferTest[mFSCI_MemAllocBufferTestIndex].timeOfNoAllocationValue, 
                    &pData->structured.payload[coppyIndex], 4);
        coppyIndex = coppyIndex + 4;
    }
    
    if(mFSCI_MemAllocBufferTest[mFSCI_MemAllocBufferTestIndex].enableTimeOfNoAllocation == TRUE)
    {
        /* Calculate end of time for Time Of No Allocation
          (timeOfNoAllocationValue in milliseconds convert to microseconds) */
        systemTime = TMR_GetTimestamp();
        mFSCI_MemAllocBufferTest[mFSCI_MemAllocBufferTestIndex].endtimeOfFailureValue = systemTime +
          TmrMillisecondsToMicroseconds(mFSCI_MemAllocBufferTest[mFSCI_MemAllocBufferTestIndex].timeOfNoAllocationValue);
    }
    
    if(mFSCI_MemAllocBufferTest[mFSCI_MemAllocBufferTestIndex].enableNumberOfBuffers == TRUE)
    {
        mFSCI_MemAllocBufferTest[mFSCI_MemAllocBufferTestIndex].counterNumberOfBuffers = 0;
    }
    
