N40E116/SDK_2_6_13_FRDM-KW38/middleware/wireless/framework/FSCI/Source/FsciCommands.c
    if((mFSCI_MemAllocBufferTest[mFSCI_MemAllocBufferTestIndex].enableNumberOfBuffers != TRUE) && 
       (mFSCI_MemAllocBufferTest[mFSCI_MemAllocBufferTestIndex].enableTimeOfNoAllocation != TRUE))
    {
        /* Prepare gFsciError_c packet, no test conditions enabled */
        pData->structured.payload[0] = gFsciError_c;
        pData->structured.header.len = sizeof(uint8_t);
    }
    else
    {
        /* Enable this slot */
        mFSCI_MemAllocBufferTest[mFSCI_MemAllocBufferTestIndex].enable = TRUE;
        
        mFSCI_MemAllocBufferTestIndex++;
        if(mFSCI_MemAllocBufferTestIndex == gFSCI_NotAllocMemoryBufferSize_c)
        {
            mFSCI_MemAllocBufferTestIndex = 0;
        }
        
        /* Prepare confirm packet  */
        pData->structured.payload[0] = gFsciSuccess_c;
        pData->structured.header.len = sizeof(uint8_t);
    }
    
    
    
    return TRUE;
}

/*! *********************************************************************************
* \brief   Verify if any available FSCI memory allocation test conditions are 
*          enabled and if the received LR is in the conditioning interval.
*          If the criteria for a condition is met return TRUE, so the buffer should
*          not be allocated else, return FALSE.
*
* \param[in] pCaller   Pointer to location of the LR that requires the buffer allocation
*
* \return  TRUE        Criteria for a condition is met do not allocate buffer.
* \return  FALSE       Criteria for a condition is not met allocate buffer.
*
********************************************************************************** */
bool_t FSCI_MemAllocTestCanAllocate(void *pCaller)
{
    uint8_t index = 0;
    uint64_t systemTime;
    for( index = 0; index < gFSCI_NotAllocMemoryBufferSize_c; index++ )
    {
         if (mFSCI_MemAllocBufferTest[index].enable == TRUE)
         {
            if(((uint32_t)pCaller <= mFSCI_MemAllocBufferTest[index].LRMaxValue) &&
               ((uint32_t)pCaller >= mFSCI_MemAllocBufferTest[index].LRMinValue))
            {
                if(mFSCI_MemAllocBufferTest[index].enableTimeOfNoAllocation == TRUE)
                {
                    systemTime = TMR_GetTimestamp();
                    if(systemTime > mFSCI_MemAllocBufferTest[index].endtimeOfFailureValue)
                    {
                        /* Time of failure for this slot passed, disable this slot */
                        mFSCI_MemAllocBufferTest[index].enable = FALSE;
                        continue;
                    }
                    
                    if(mFSCI_MemAllocBufferTest[index].enableNumberOfBuffers == FALSE)
                    {
                        /* Return TRUE so buffer will no be allocated */
                        return TRUE;
                    }
                }
                
                if(mFSCI_MemAllocBufferTest[index].enableNumberOfBuffers == TRUE)
                {
                    if(mFSCI_MemAllocBufferTest[index].numberOfBuffersValue > mFSCI_MemAllocBufferTest[index].counterNumberOfBuffers)
                    {
                        /* Return TRUE so buffer will no be allocated */
                        mFSCI_MemAllocBufferTest[index].counterNumberOfBuffers++;
                        return TRUE;
                    }
                    else if(mFSCI_MemAllocBufferTest[index].numberOfBuffersValue == mFSCI_MemAllocBufferTest[index].counterNumberOfBuffers)
                    {
                        mFSCI_MemAllocBufferTest[index].enable = FALSE;
                        continue;
                    }
                    else
                    {
                        /* MISRA */
                    }
                }
            }
         }
    }
    return FALSE;
}
#endif /* gFSCI_MemAllocTest_Enabled_d */

/*! *********************************************************************************
* \brief  This function handles the requests for the OTA OpCodes
*
* \param[in] pData pointer to location of the received data
* \param[in] fsciInterface the interface on which the packet was received
*
* \return  TRUE in order to recycle the received message
*
********************************************************************************** */
bool_t FSCI_OtaSupportHandlerFunc(clientPacket_t * pData, uint32_t fsciInterface)
{
    bool_t status = FALSE;
#if gFSCI_IncludeMacCommands_c && gFsciHost_802_15_4_c
    (void)Serial_SyncWrite( gFsciSerialInterfaces[fsciHostGetMacInterfaceId(fsciGetMacInstanceId(fsciInterface))],
                            pData, sizeof(clientPacketHdr_t) + pData->structured.header.len + 1);
#else
    if( pfFSCI_OtaSupportCalback != NULL )
    {
        status = pfFSCI_OtaSupportCalback(pData);
    }
#endif
    if (status == FALSE)
    {
        (void)MEM_BufferFree(pData);
    }

    return status;
}
/*! *********************************************************************************
* \brief  This function handles the requests for enable the MSD Bootloader
*
* \param[in] pData pointer to location of the received data
* \param[in] fsciInterface the interface on which the packet was received
*
* \return  TRUE if the received message was recycled, FALSE if it must be deleted
*
********************************************************************************** */
bool_t FSCI_EnableBootloaderFunc(clientPacket_t * pData, uint32_t fsciInterface)
{
#ifdef USE_MSD_BOOTLOADER
    (void)NV_FlashEraseSector(0xBFF8, FSL_FEATURE_FLASH_PFLASH_BLOCK_SECTOR_SIZE);
#else
    union {
        uint8_t  aBootloaderTrigger[FSL_FEATURE_FLASH_PFLASH_BLOCK_WRITE_UNIT_SIZE];
        uint32_t bootloaderTrigger;
    }flag;

    flag.bootloaderTrigger = gFsciBootTrigger_c;

    if (FLib_MemCmpToVal((uint8_t const*)gBootImageFlagsAddress_c, 0xFF, (uint8_t)FSL_FEATURE_FLASH_PFLASH_BLOCK_WRITE_UNIT_SIZE) == TRUE)
    {
        (void)NV_FlashProgramUnaligned(gBootImageFlagsAddress_c, sizeof(flag), flag.aBootloaderTrigger);
    }
#endif
    ResetMCU();
    return FALSE;
}


#endif /* gFsciIncluded_c */
